/*
Написать прогрмаму, которая из имеющегося массива строк, формирует массив из строк, длина которых меньше либо вана 3м символам. 
Первоначальный массив можно ввести с клавиатуру, либо задать на старте выполения алгоритма. 
При решении не рекомендуется пользоваться коллекциями, лучше обойтись массивами.

Примеры:
["hello","2","world",":-)"] -> ["2",":-)"]
["1234","1567","-2","computer sciense"] -> ["-2"]
["Russia","Denmark","Kazan",":-)"] -> []
*/
Console.WriteLine("Hello, World!");
